console.log('1. Вёрстка валидная 10/10.\n2. Вёрстка семантическая 16/16.\n2.1 <header>, <main>, <footer> +2.\n2.2 <section>X6 +2.\n2.3 Только один заголовок <h1> +2.\n2.4 Пять заголовков <h2> +2.\n2.5 Один элемент <nav> +2.\n2.6 Два списка ul > li > a (панель навигации, ссылки на соцсети в футере) +2.\n2.7 Семь кнопок <button> +2.\n2.8 Два инпута <input> +2.\n3. Вёрстка соответствует макету 54/54.\n3.1 Блок <header> 8/8.\n3.1.1 Расстояние между элементами меню 30px.\n3.1.2 Элементы меню работают как якоря.\n3.1.3 Элементы интерактивны.\n3.1.4 Расстояние от самого меню до иконки пользователя - 40px. Иконка является отдльным элементом, и не входит в <nav>.\n3.1.5 Текст "Brooklyn Public Library" находится в <h1>.\n3.2 Секция Welcome 4/4.\n3.3 Секция About 6/6.\n3.3.1 Добавьте все картинки, которые будут использованы в папку с картинками.\n3.3.2 Расстояния между кнопками пагинации 10px.\n3.3.3 Интерактивная область +5px к кнопкам пагинации.\n3.4 Секция Favorites 8/8.\n3.4.1 Интерактивные кнопки дожны иметь структуру input type="radio" + label.\n3.4.2 Интерактивная область +5px к radio button.\n3.4.3 Сезонные секции добавлены, картинка загружены, неактивные секции скрыты.\n3.4.4 Кнопки "buy" должны быть интерактивными, плавно менять свой цвет при наведении на них.\n3.4.5 Кнопка "own" не должна быть интерактивной, не должна нажиматься. И на ней должен присутствовать атрибут disabled.\n3.5 Секция CoffeShop 6/6.\n3.6 Секция Contacts 6/6.\n3.6.1 Карта вставлена картинкой.\n3.6.2 Везде, где в тексте встречаются цифры в виде телефонного номера, это должны быть ссылки с типом "tel" и номером.\n3.6.3 Там, где в тексте встречается текст с именем контактного лица, это должна быть ссылка с типом "mailto" и адресом почты.\n3.7 Секция LibraryCard 8/8.\n3.7.1 "Find your Library card" - это должа быть форма с полями input.\n3.7.2 Все 3 кнопки должны быть интерактивными, плавно менять свой цвет при наведении на них, как указано в макете styleguides.\n3.8 Блок <footer> 8/8.\n3.8.1 Адрес библиотеки должен быть ссылкой.\n3.8.2 Иконки соцсетей также должны быть ссылками.\n3.8.3 Вместо Username должно быть ваше имя, как оно пишется на английском языке и ссылка на GitHub.')
console.log('4. Общие требования к верстке 20/20.\n4.1 Для построения сетки используются флексы или гриды (display: flex... или display: grid...) +2.\n4.2 При уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону +2.\n4.3 Иконки добавлены в формате .svg +2.\n4.4 Изображения добавлены в формате .jpg (.jpeg) или .png +2.\n4.5 Есть favicon +2.\n4.6 Плавная прокрутка по якорям +2.\n4.7 В футере название ссылки Username заменено и ведет на GitHub студента +2.\n4.8 В футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/ +2.\n4.9 Интерактивность элементов согласно макету +2.\n4.10 Павное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы +2.')
console.log('Итог:100/100')
// console.log('1. Вёрстка валидная 10/10.\n
//             2. Вёрстка семантическая 16/16.\n
//                 2.1 <header>, <main>, <footer> +2.\n
//                 2.2 <section>X6 +2.\n
//                 2.3 Только один заголовок <h1> +2.\n
//                 2.4 Пять заголовков <h2> +2.\n
//                 2.5 Один элемент <nav> +2.\n
//                 2.6 Два списка ul > li > a (панель навигации, ссылки на соцсети в футере) +2.\n
//                 2.7 Семь кнопок <button> +2.\n
//                 2.8 Два инпута <input> +2.\n
//             3. Вёрстка соответствует макету 54/54.\n
//                 3.1 Блок <header> 8/8.\n
//                     3.1.1 Расстояние между элементами меню 30px.\n
//                     3.1.2 Элементы меню работают как якоря.\n
//                     3.1.3 Элементы интерактивны.\n
//                     3.1.4 Расстояние от самого меню до иконки пользователя - 40px. Иконка является отдльным элементом, и не входит в <nav>.\n
//                     3.1.5 Текст "Brooklyn Public Library" находится в <h1>.\n
//                 3.2 Секция Welcome 4/4.\n
//                 3.3 Секция About 6/6.\n
//                     3.3.1 Добавьте все картинки, которые будут использованы в папку с картинками.\n
//                     3.3.2 Расстояния между кнопками пагинации 10px.\n
//                     3.3.3 Интерактивная область +5px к кнопкам пагинации.\n
//                 3.4 Секция Favorites 8/8.\n
//                     3.4.1 Интерактивные кнопки дожны иметь структуру input type="radio" + label.\n
//                     3.4.2 Интерактивная область +5px к radio button.\n
//                     3.4.3 Сезонные секции добавлены, картинка загружены, неактивные секции скрыты.\n
//                     3.4.4 Кнопки "buy" должны быть интерактивными, плавно менять свой цвет при наведении на них.\n
//                     3.4.5 Кнопка "own" не должна быть интерактивной, не должна нажиматься. И на ней должен присутствовать атрибут disabled.\n
//                 3.5 Секция CoffeShop 6/6.\n
//                 3.6 Секция Contacts 6/6.\n
//                     3.6.1 Карта вставлена картинкой.\n
//                     3.6.2 Везде, где в тексте встречаются цифры в виде телефонного номера, это должны быть ссылки с типом "tel" и номером.\n
//                     3.6.3 Там, где в тексте встречается текст с именем контактного лица, это должна быть ссылка с типом "mailto" и адресом почты.\n
//                 3.7 Секция LibraryCard 8/8.\n
//                     3.7.1 "Find your Library card" - это должа быть форма с полями input.\n
//                     3.7.2 Все 3 кнопки должны быть интерактивными, плавно менять свой цвет при наведении на них, как указано в макете styleguides.\n
//                 3.8 Блок <footer> 8/8.\n
//                     3.8.1 Адрес библиотеки должен быть ссылкой.\n
//                     3.8.2 Иконки соцсетей также должны быть ссылками.\n
//                     3.8.3 Вместо Username должно быть ваше имя, как оно пишется на английском языке и ссылка на GitHub.\n
//             4. Общие требования к верстке 20/20.\n
//                 4.1 Для построения сетки используются флексы или гриды (display: flex... или display: grid...) +2.\n
//                 4.2 При уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону +2.\n
//                 4.3 Иконки добавлены в формате .svg +2.\n
//                 4.4 Изображения добавлены в формате .jpg (.jpeg) или .png +2.\n
//                 4.5 Есть favicon +2.\n
//                 4.6 Плавная прокрутка по якорям +2.\n
//                 4.7 В футере название ссылки Username заменено и ведет на GitHub студента +2.\n
//                 4.8 В футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/ +2.\n
//                 4.9 Интерактивность элементов согласно макету +2.\n
//                 4.10 Павное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы +2.')